pontech/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
};

/**************************************************
 * USB Device Function Driver Init Data
 **************************************************/
const USB_DEVICE_CDC_INIT cdcInit0 ={
    .queueSizeRead = 2,
    .queueSizeWrite = 2,
    .queueSizeSerialStateNotification = 1
};
const USB_DEVICE_CDC_INIT cdcInit1 ={
    .queueSizeRead = 2,
    .queueSizeWrite = 2,
    .queueSizeSerialStateNotification = 1
};
const USB_DEVICE_HID_INIT hidInit0 ={
    .hidReportDescriptorSize = sizeof (_hidReportDescriptor),
    .hidReportDescriptor = &_hidReportDescriptor,
    .queueSizeReportReceive = 1,
    .queueSizeReportSend = 1
};
/**************************************************
 * USB Device Layer Function Driver Registration 
 * Table
 **************************************************/
const USB_DEVICE_FUNCTION_REGISTRATION_TABLE funcRegistrationTable[(_NUM_CDC_ + _NUM_HID_)] ={
#if (_NUM_CDC_ >= 1)
    /* Function 1 */
    {
        .configurationValue = 1, /* Configuration value */
        .interfaceNumber = 0, /* First interfaceNumber of this function */
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 2, /* Number of interfaces */
        .funcDriverIndex = 0, /* Index of CDC Function Driver */
        .driver = (void*) USB_DEVICE_CDC_FUNCTION_DRIVER, /* USB CDC function data exposed to device layer */
        .funcDriverInit = (void*) &cdcInit0 /* Function driver init data */
    },
#endif
#if (_NUM_CDC_ >= 2)
    /* Function 2 */
    {
        .configurationValue = 1, /* Configuration value */
        .interfaceNumber = 2, /* First interfaceNumber of this function */
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 2, /* Number of interfaces */
        .funcDriverIndex = 1, /* Index of CDC Function Driver */
        .driver = (void*) USB_DEVICE_CDC_FUNCTION_DRIVER, /* USB CDC function data exposed to device layer */
        .funcDriverInit = (void*) &cdcInit1 /* Function driver init data */
    },
#endif
#if (_NUM_HID_ >= 1) 
    /* Function 3 */
    {
        .configurationValue = 1, /* Configuration value */
#if (_NUM_CDC_==2)
        .interfaceNumber = 4, /* First interfaceNumber of this function */
#elif (_NUM_CDC_==1)
        .interfaceNumber = 2, /* First interfaceNumber of this function */
#elif (_NUM_CDC_==0)
        .interfaceNumber = 0, /* First interfaceNumber of this function */
#endif
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 1, /* Number of interfaces */
        .funcDriverIndex = 0, /* Index of HID Function Driver */
        .driver = (void*) USB_DEVICE_HID_FUNCTION_DRIVER, /* USB HID function data exposed to device layer */
        .funcDriverInit = (void*) &hidInit0, /* Function driver init data */
    },
#endif
};

/*******************************************
 * USB Device Layer Descriptors
 *******************************************/

/*******************************************
*  USB Device Qualifier Descriptor for this
*  demo.
*******************************************/
const USB_DEVICE_QUALIFIER deviceQualifierDescriptor1 =
{
	0x0A,                               // Size of this descriptor in bytes
	USB_DESCRIPTOR_DEVICE_QUALIFIER,    // Device Qualifier Type
	0x0200,                             // USB Specification Release number
	0xEF,                           // Class Code
	0x02,                           // Subclass code
	0x01,                           // Protocol code
	USB_DEVICE_EP0_BUFFER_SIZE,         // Maximum packet size for endpoint 0
	0x01,                               // Number of possible configurations
	0x00                                // Reserved for future use.
};

/*******************************************
 *  USB Device Descriptor 
 *******************************************/
const USB_DEVICE_DESCRIPTOR deviceDescriptor ={
    0x12, // Size of this descriptor in bytes
    USB_DESCRIPTOR_DEVICE, // DEVICE descriptor type
    0x0200, // USB Spec Release Number in BCD format
    0xEF, // Class Code
    0x02, // Subclass code
    0x01, // Protocol code
    USB_DEVICE_EP0_BUFFER_SIZE, // Max packet size for EP0, see system_config.h
    _USB_VID_, // Vendor ID
    _USB_PID_, // Product ID
    0x0100, // Device release number in BCD format
    0x01, // Manufacturer string index
    0x02, // Product string index
    0x03, // Device serial number string index
    0x01 // Number of possible configurations
};
// Sizes for the different interfaces
#define CFG_HEADER 9
#define CFG_CDCACM (8+9+5+4+5+5+7+9+7+7)
#define CFG_HID (9+9+7+7)


/*******************************************
 *  USB Full Speed Configuration Descriptor
 *******************************************/
const uint8_t fullSpeedConfigurationDescriptor[] ={
    /* Configuration Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_CONFIGURATION, // Descriptor Type
//    173, 0, //(173 Bytes)Size of the Config descriptor.e
#if (_NUM_CDC_==2) && (_NUM_HID_==1)
    (CFG_HEADER+CFG_CDCACM+CFG_CDCACM+CFG_HID),
#elif (_NUM_CDC_==2) && (_NUM_HID_==0)
    (CFG_HEADER+CFG_CDCACM+CFG_CDCACM),
#elif (_NUM_CDC_==1) && (_NUM_HID_==1)
    (CFG_HEADER+CFG_CDCACM+CFG_HID),
#elif (_NUM_CDC_==1) && (_NUM_HID_==0)
    (CFG_HEADER+CFG_CDCACM),
#elif (_NUM_CDC_==0) && (_NUM_HID_==1)
    (CFG_HEADER+CFG_HID),
#elif (_NUM_CDC_==0) && (_NUM_HID_==0)
    (CFG_HEADER),
#endif
    0,
    // Number of interfaces in this cfg (5)
#if (_NUM_CDC_==2) && (_NUM_HID_==1)
    5,
#elif (_NUM_CDC_==2) && (_NUM_HID_==0)
    4,
#elif (_NUM_CDC_==1) && (_NUM_HID_==1)
    3,
#elif (_NUM_CDC_==1) && (_NUM_HID_==0)
    2,
#elif (_NUM_CDC_==0) && (_NUM_HID_==1)
    1,
#elif (_NUM_CDC_==0) && (_NUM_HID_==0)
    0,
#endif
    0x01, // Index value of this configuration
    0x00, // Configuration string index
    USB_ATTRIBUTE_DEFAULT | USB_ATTRIBUTE_SELF_POWERED, // Attributes
    250, // Max power consumption (2X mA)

#if (_NUM_CDC_ >= 1)
/*********************************************************
 *                   FIRST CDC/ACM PORT                  *
 *********************************************************/
    /* Descriptor for Function 1 - CDC     */
    /* Interface Association Descriptor: CDC Function 1*/
    0x08, // Size of this descriptor in bytes
    0x0B, // Interface association descriptor type
    0, // The first associated interface
    0x02, // Number of contiguous associated interface
    0x02, // bInterfaceClass of the first interface
    0x02, // bInterfaceSubclass of the first interface
    0x00, // bInterfaceProtocol of the first interface
    0x00, // Interface string index

