pontech/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // Descriptor Type
    0, // Interface Number
    0x00, // Alternate Setting Number
    0x01, // Number of endpoints in this interface
    USB_CDC_COMMUNICATIONS_INTERFACE_CLASS_CODE, // Class code
    USB_CDC_SUBCLASS_ABSTRACT_CONTROL_MODEL, // Subclass code
    USB_CDC_PROTOCOL_NO_CLASS_SPECIFIC, // Protocol code
    0x00, // Interface string index

    /* CDC Class-Specific Descriptors */

    sizeof (USB_CDC_HEADER_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_HEADER, // Type of functional descriptor
    0x20, 0x01, // CDC spec version

    sizeof (USB_CDC_ACM_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_ABSTRACT_CONTROL_MANAGEMENT, // Type of functional descriptor
    USB_CDC_ACM_SUPPORT_LINE_CODING_LINE_STATE_AND_NOTIFICATION, // bmCapabilities of ACM

    sizeof (USB_CDC_UNION_FUNCTIONAL_DESCRIPTOR_HEADER) + 1, // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_UNION, // Type of functional descriptor
    0, // com interface number
    1,

    sizeof (USB_CDC_CALL_MANAGEMENT_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_CALL_MANAGEMENT, // Type of functional descriptor
    0x00, // bmCapabilities of CallManagement
    1, // Data interface number

    /* Interrupt Endpoint (IN)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    1 | USB_EP_DIRECTION_IN, // EndpointAddress ( EP1 IN INTERRUPT)
    USB_TRANSFER_TYPE_INTERRUPT, // Attributes type of EP (INTERRUPT)
    0x10, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // INTERFACE descriptor type
    1, // Interface Number
    0x00, // Alternate Setting Number
    0x02, // Number of endpoints in this interface
    USB_CDC_DATA_INTERFACE_CLASS_CODE, // Class code
    0x00, // Subclass code
    USB_CDC_PROTOCOL_NO_CLASS_SPECIFIC, // Protocol code
    0x00, // Interface string index

    /* Bulk Endpoint (OUT)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    2 | USB_EP_DIRECTION_OUT, // EndpointAddress ( EP2 OUT)
    USB_TRANSFER_TYPE_BULK, // Attributes type of EP (BULK)
    0x40, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

    /* Bulk Endpoint (IN)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    3 | USB_EP_DIRECTION_IN, // EndpointAddress ( EP2 IN )
    0x02, // Attributes type of EP (BULK)
    0x40, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

#endif
#if (_NUM_CDC_ >= 2)

/*********************************************************
 *                  SECOND CDC/ACM PORT                  *
 *********************************************************/

    /* Descriptor for Function 2 - CDC     */
    /* Interface Association Descriptor: CDC Function 2*/
    0x08, // Size of this descriptor in bytes
    0x0B, // Interface association descriptor type
    2, // The first associated interface
    0x02, // Number of contiguous associated interface
    0x02, // bInterfaceClass of the first interface
    0x02, // bInterfaceSubclass of the first interface
    0x00, // bInterfaceProtocol of the first interface
    0x00, // Interface string index

    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // Descriptor Type
    2, // Interface Number
    0x00, // Alternate Setting Number
    0x01, // Number of endpoints in this interface
    USB_CDC_COMMUNICATIONS_INTERFACE_CLASS_CODE, // Class code
    USB_CDC_SUBCLASS_ABSTRACT_CONTROL_MODEL, // Subclass code
    USB_CDC_PROTOCOL_NO_CLASS_SPECIFIC, // Protocol code
    0x00, // Interface string index

    /* CDC Class-Specific Descriptors */

    sizeof (USB_CDC_HEADER_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_HEADER, // Type of functional descriptor
    0x20, 0x01, // CDC spec version

    sizeof (USB_CDC_ACM_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_ABSTRACT_CONTROL_MANAGEMENT, // Type of functional descriptor
    USB_CDC_ACM_SUPPORT_LINE_CODING_LINE_STATE_AND_NOTIFICATION, // bmCapabilities of ACM

    sizeof (USB_CDC_UNION_FUNCTIONAL_DESCRIPTOR_HEADER) + 1, // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_UNION, // Type of functional descriptor
    2, // com interface number
    3,

    sizeof (USB_CDC_CALL_MANAGEMENT_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_CALL_MANAGEMENT, // Type of functional descriptor
    0x00, // bmCapabilities of CallManagement
    3, // Data interface number

    /* Interrupt Endpoint (IN)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    4 | USB_EP_DIRECTION_IN, // EndpointAddress ( EP3 IN INTERRUPT)
    USB_TRANSFER_TYPE_INTERRUPT, // Attributes type of EP (INTERRUPT)
    0x10, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // INTERFACE descriptor type
    3, // Interface Number
    0x00, // Alternate Setting Number
    0x02, // Number of endpoints in this interface
    USB_CDC_DATA_INTERFACE_CLASS_CODE, // Class code
    0x00, // Subclass code
    USB_CDC_PROTOCOL_NO_CLASS_SPECIFIC, // Protocol code
    0x00, // Interface string index

    /* Bulk Endpoint (OUT)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    5 | USB_EP_DIRECTION_OUT, // EndpointAddress ( EP4 OUT)
    USB_TRANSFER_TYPE_BULK, // Attributes type of EP (BULK)
    0x40, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

    /* Bulk Endpoint (IN)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    6 | USB_EP_DIRECTION_IN, // EndpointAddress ( EP4 IN )
    0x02, // Attributes type of EP (BULK)
    0x40, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)
#endif
#if (_NUM_HID_ >= 1)
/*********************************************************
 *                     HID INTERFACE                     *
 *********************************************************/
    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // INTERFACE descriptor type
    // Interface Number
#if (_NUM_CDC_==2)
    4,
#elif (_NUM_CDC_==1)
    2,
#elif (_NUM_CDC_==0)
    0,
#endif
    0, // Alternate Setting Number
    2, // Number of endpoints in this interface
    USB_HID_CLASS_CODE, // Class code
    USB_HID_SUBCLASS_CODE_NO_SUBCLASS, // Subclass code
    USB_HID_PROTOCOL_CODE_NONE, // No Protocol
    0, // Interface string index

