pontech/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
    /* HID Class-Specific Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_HID_DESCRIPTOR_TYPES_HID, // HID descriptor type
    0x11, 0x01, // HID Spec Release Number in BCD format (1.11)
    0x00, // Country Code (0x00 for Not supported)
    1, // Number of class descriptors, see usbcfg.h
    USB_HID_DESCRIPTOR_TYPES_REPORT, // Report descriptor type
    USB_DEVICE_16bitTo8bitArrange(sizeof (_hidReportDescriptor)), // Size of the report descriptor

    /* Endpoint Descriptor */

    0x07, // Size of this descriptor in bytes
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
#if (_NUM_CDC_==2)
    7 | USB_EP_DIRECTION_IN, // EndpointAddress
#elif (_NUM_CDC_==1)
    4 | USB_EP_DIRECTION_IN, // EndpointAddress
#elif (_NUM_CDC_==0)
    1 | USB_EP_DIRECTION_IN, // EndpointAddress
#endif
    USB_TRANSFER_TYPE_INTERRUPT, // Attributes
    0x40, 0x00, // Size
    0x01, // Interval

    /* Endpoint Descriptor */

    0x07, // Size of this descriptor in bytes
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
#if (_NUM_CDC_==2)
    8 | USB_EP_DIRECTION_OUT, // EndpointAddress
#elif (_NUM_CDC_==1)
    5 | USB_EP_DIRECTION_OUT, // EndpointAddress
#elif (_NUM_CDC_==0)
    2 | USB_EP_DIRECTION_OUT, // EndpointAddress
#endif
    USB_TRANSFER_TYPE_INTERRUPT, // Attributes
    0x40, 0x00, // size
    0x01, // Interval
#endif



};

/*******************************************
 * Array of Full speed config descriptors
 *******************************************/
USB_DEVICE_CONFIGURATION_DESCRIPTORS_TABLE fullSpeedConfigDescSet[1] ={
    fullSpeedConfigurationDescriptor
};


/**************************************
 *  String descriptors.
 *************************************/

/*******************************************
 *  Language code string descriptor
 *******************************************/
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[1]; // String
}

sd000 ={
    0, // Index of this string is 0
    0, // This field is always blank for String Index 0
    sizeof (sd000) - sizeof (sd000.stringIndex) - sizeof (sd000.languageID),
    USB_DESCRIPTOR_STRING,
    {
        0x0409} // Language ID
};

/*******************************************
 *  Manufacturer string descriptor
 *******************************************/
#ifndef _USB_MANUFACTURER_
#define _USB_MANUFACTURER_ 'c','h','i','p','K','I','T'
#define _USB_MANUFACTURER_LENGTH_ 7
#endif
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type
    uint16_t string[_USB_MANUFACTURER_LENGTH_]; // String
}

sd001 ={
    1, // Index of this string descriptor is 1. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd001) - sizeof (sd001.stringIndex) - sizeof (sd001.languageID),
    USB_DESCRIPTOR_STRING,
    {
        _USB_MANUFACTURER_
    }
};

/*******************************************
 *  Product string descriptor
 *******************************************/

#ifndef _USB_PRODUCT_
#define _USB_PRODUCT_ 'M', 'P', 'I', 'D', 'E', ' ', 'C', 'o', 'm', 'p', 'a', 't', 'i', 'b', 'l', 'e', ' ', 'D', 'e', 'v', 'i', 'c', 'e'
#define _USB_PRODUCT_LENGTH_ 23
#endif

const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[_USB_PRODUCT_LENGTH_]; // String
}
sd002 ={
    2, // Index of this string descriptor is 2. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd002) - sizeof (sd002.stringIndex) - sizeof (sd002.languageID),
    USB_DESCRIPTOR_STRING,
    {
        _USB_PRODUCT_
    }
};

/*******************************************
 *  Product string descriptor
 *******************************************/
struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[14]; // String
}
sd003 ={
    3, // Index of this string descriptor is 3. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd003) - sizeof (sd003.stringIndex) - sizeof (sd003.languageID),
    USB_DESCRIPTOR_STRING,
    {
        'C', 'K', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'
    }
};


/***************************************
 * Array of string descriptors
 ***************************************/
USB_DEVICE_STRING_DESCRIPTORS_TABLE stringDescriptors[4] ={
    (const uint8_t * const) &sd000,
    (const uint8_t * const) &sd001,
    (const uint8_t * const) &sd002,
    (uint8_t *) &sd003
};


/*******************************************
 * USB Device Layer Master Descriptor Table 
 *******************************************/
const USB_DEVICE_MASTER_DESCRIPTOR usbMasterDescriptor ={
    &deviceDescriptor, /* Full speed descriptor */
    1, /* Total number of full speed configurations available */
    fullSpeedConfigDescSet, /* Pointer to array of full speed configurations descriptors*/
    NULL,
    0,
    NULL,
    4, // Total number of string descriptors available.
    stringDescriptors, // Pointer to array of string descriptors.
	NULL,	// full speed device qualifier
    NULL
};


/****************************************************
 * USB Device Layer Initialization Data
 ****************************************************/
const USB_DEVICE_INIT usbDevInitData ={
    /* System module initialization */
    .moduleInit =
    {SYS_MODULE_POWER_RUN_FULL},

