pontech/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
    /* Number of function drivers registered to this instance of the
       USB device layer */
    .registeredFuncCount = _NUM_CDC_+_NUM_HID_,

    /* Function driver table registered to this instance of the USB device layer*/
    .registeredFunctions = (USB_DEVICE_FUNCTION_REGISTRATION_TABLE*) funcRegistrationTable,

    /* Pointer to USB Descriptor structure */
    .usbMasterDescriptor = (USB_DEVICE_MASTER_DESCRIPTOR*) & usbMasterDescriptor,

    /* USB Device Speed */
    .deviceSpeed = USB_SPEED_FULL,

#if defined(USB_DRV_HS)
	/* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBHS_INDEX,

	/* Pointer to the USB Driver Functions. */
	.usbDriverInterface = DRV_USBHS_DEVICE_INTERFACE,
#else
    /* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBFS_INDEX,

    /* Pointer to the USB Driver Functions. */
    .usbDriverInterface = DRV_USBFS_DEVICE_INTERFACE,
#endif
};

// </editor-fold>

// *****************************************************************************
// *****************************************************************************
// Section: Driver Initialization Data
// *****************************************************************************
// *****************************************************************************

//<editor-fold defaultstate="collapsed" desc="DRV_USB Initialization Data">

#if defined(USB_DRV_HS)

	/* USBHS Driver Initialization ********************/
	const DRV_USBHS_INIT drvUSBInit = {
		/* Interrupt Source for USB module */
		.interruptSource = DRV_USBHS_INTERRUPT_SOURCE,

		/* Interrupt Source for USB module */
		.interruptSourceUSBDma = INT_SOURCE_USB_1_DMA,

		/* System module initialization */
		.moduleInit = { SYS_MODULE_POWER_RUN_FULL },

		.operationMode = DRV_USBHS_OPMODE_DEVICE,

		.operationSpeed = USB_SPEED_FULL,

		/* Stop in idle */
		.stopInIdle = false,

		/* Suspend in sleep */
		.suspendInSleep = false,

		/* Identifies peripheral (PLIB-level) ID */
		.usbID = DRV_USBHS_PERIPHERAL_ID,
	};

#else

	/* USBFS Driver Initialization ********************/
	uint8_t __attribute__((aligned(512))) endPointTable[DRV_USBFS_ENDPOINTS_NUMBER * 32];
	const DRV_USBFS_INIT drvUSBInit ={
		/* Assign the endpoint table */
		.endpointTable = endPointTable,

		/* Interrupt Source for USB module */
		.interruptSource = DRV_USBFS_INTERRUPT_SOURCE,

		/* System module initialization */
		.moduleInit =
		{SYS_MODULE_POWER_RUN_FULL},

		.operationMode = DRV_USBFS_OPMODE_DEVICE,

		.operationSpeed = USB_SPEED_FULL,

		/* Stop in idle */
		.stopInIdle = false,

		/* Suspend in sleep */
		.suspendInSleep = false,

		/* Identifies peripheral (PLIB-level) ID */
		.usbID = DRV_USBFS_PERIPHERAL_ID
	};

#endif
// </editor-fold>

#endif // _USB

// *****************************************************************************
// *****************************************************************************
// Section: System Data
// *****************************************************************************
// *****************************************************************************

/* Structure to hold the object handles for the modules in the system. */
HARMONY_SYSTEM_OBJECTS HarmonySysObj;

// </editor-fold>


// *****************************************************************************
// *****************************************************************************
// Section: Static Initialization Functions
// *****************************************************************************
// *****************************************************************************

#define D2H(X) ((X & 0xF) < 10 ? '0' + (X & 0xF) : 'A' - 10 + (X & 0xF))

void Harmony_SYS_InitDrivers(void* data)
{
	/* Initialize Drivers */

#if defined (_USB)

    sd003.string[2] = D2H(DEVID >> 28);
    sd003.string[3] = D2H(DEVID >> 24);
    sd003.string[4] = D2H(DEVID >> 20);
    sd003.string[5] = D2H(DEVID >> 16);
    sd003.string[6] = D2H(DEVID >> 12);
    sd003.string[7] = D2H(DEVID >> 8);
    sd003.string[8] = D2H(DEVID >> 4);
    sd003.string[9] = D2H(DEVID);
    sd003.string[10] = D2H(DEVCFG3 >> 12);
    sd003.string[11] = D2H(DEVCFG3 >> 8);
    sd003.string[12] = D2H(DEVCFG3 >> 4);
    sd003.string[13] = D2H(DEVCFG3);

	#if defined(USB_DRV_HS)

		/* Initialize HS USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBHS_Initialize(DRV_USBHS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#else
		/* Initialize FS USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBFS_Initialize(DRV_USBFS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#endif
#endif
    
}

void Harmony_SYS_InitDevices(void* data)
{
    
#if defined (_USB)    
    /* Initialize the USB device layer */
    HarmonySysObj.usbDevObject0 = USB_DEVICE_Initialize(USB_DEVICE_INDEX_0, (SYS_MODULE_INIT*) & usbDevInitData);
#endif
    
}

void Harmony_SYS_InitApplication(void* data)
{
    Harmony_APP_Initialize();
}

// *****************************************************************************
// *****************************************************************************
// Section: System Interrupt Vector Functions
// *****************************************************************************
// *****************************************************************************

#if defined(_USB)

	#if defined(USB_DRV_HS)
		/* Implemented in wiring.c. Returns MS elapsed since power on. */
		extern unsigned long millis();

		/* Hacked time structure. */
		typedef struct _SYS_TIMER_OBJECT_HACK
		{
			uint32_t timerStartTime;
			uint32_t timerPeriod;
		}SYS_TIMER_OBJECT_HACK;

		/* Hacked timer instance.  One is all that is needed for USBHS driver. */
		static SYS_TIMER_OBJECT_HACK mTimerObjectHack = { 0, 0 };

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		SYS_TMR_HANDLE SYS_TMR_DelayMS(uint32_t delayMs)
		{
			mTimerObjectHack.timerStartTime = millis();
			mTimerObjectHack.timerPeriod = delayMs;

			return (SYS_TMR_HANDLE)&mTimerObjectHack;
		}

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		bool SYS_TMR_DelayStatusGet(SYS_TMR_HANDLE handle)
		{
			return ((millis() - ((SYS_TIMER_OBJECT_HACK*)handle)->timerStartTime) >= ((SYS_TIMER_OBJECT_HACK*)handle)->timerPeriod);
		}

		// USB HS interrupt handler
		void __USER_ISR _IntHandlerUSBInstance0(void)
		{
			DRV_USBHS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}

		// USBDMA interrupt handler
		void __USER_ISR _IntHandlerUSBInstance0_USBDMA(void)
		{
			DRV_USBHS_Tasks_ISR_USBDMA(HarmonySysObj.drvUSBObject);
		}
	#else

		// USB FS interrupt handler
		void __USER_ISR _IntHandlerUSBInstance0(void)
		{
			DRV_USBFS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}

	#endif

#endif

void Harmony_SYS_Tasks(void)
{
    /* Maintain system services */
    //    SYS_DEVCON_Tasks(HarmonySysObj.sysDevcon);

    /* Maintain Device Drivers */

    /* Maintain Middleware & Other Libraries */

#if defined(_USB)

	#if defined(USB_DRV_HS)
		/* USB FS Driver Task Routine */
		DRV_USBHS_Tasks(HarmonySysObj.drvUSBObject);
	#else
		/* USB FS Driver Task Routine */
		DRV_USBFS_Tasks(HarmonySysObj.drvUSBObject);
	#endif

    /* USB Device layer tasks routine */
    USB_DEVICE_Tasks(HarmonySysObj.usbDevObject0);

#endif
    
    /* Maintain the application's state machine. */
    Harmony_APP_Tasks();
}

/*******************************************************************************
 End of File
 */

